/**
 * 播放列表
 * @type {Array}
 * 请用数组来定义总列表
 * 再用二维数组定义每个列表
 * 其中列表里的每首歌需用对象定义
 * 请在每个列表中的第一个元素定义列表信息（必须位于第一位）
 * 列表信息必须有一个basic属性，值为true
 * 还要有一个name属性，值为列表名称
 * 可选参数为singer、image，用于为定义的该属性的歌曲调用
 * 每首歌必须有name、src、lrc三个属性
 * src为歌曲相对于index.html的相对路径或绝对路径
 * 可选singer和image属性
 * 在每首歌没有定义singer或image时将使用列表的singer或image
 * 请确保一定有一个被定义
 * 其中name为歌曲名称
 * src为歌曲文件路径
 * lrc为歌词，请用\n或\r将每行歌词隔开，否则无法识别
 */
var mplayer_song = [
	[{
			"basic": true,
			"name": "我喜欢",
			"singer": "",
			"img": "https://y.gtimg.cn/music/photo_new/T001R300x300M000000CK5xN3yZDJt.jpg"
		},
		{
			"name": "平凡之路",
			"singer": "朴树",
			"time": "05:01",
			"img": "http://imgcache.qq.com/music/photo/album_500/51/500_albumpic_1796451_0.jpg",
			"src": "http://www.ytmp3.cn/down/48823.mp3",
			"lrc": "[ti:平凡之路][ar:朴树][al:《后会无期》主题歌][by:周敏][t_time:(05:01)][00:00.31](《后会无期》主题歌)[00:02.41]朴树 - 平凡之路[00:03.76]作词：韩寒 朴树[00:05.67]作曲：朴树 编曲：朴树[00:07.16]歌词编辑：周敏QQ1184854945[00:12.12]徘徊着的 在路上的[00:17.47]你要走吗[00:23.30]易碎的 骄傲着[00:28.85]那也曾是我的模样[00:34.65]沸腾着的 不安着的[00:40.36]你要去哪[00:46.10]谜一样的 沉默着的[00:51.85]故事你真的在听吗[00:56.35]我曾经跨过山和大海[00:59.65]也穿过人山人海[01:02.80]我曾经拥有着一切[01:05.10]转眼都飘散如烟[01:07.85]我曾经失落失望失掉所有方向[01:13.56]直到看见平凡才是唯一的答案[01:31.80]当你仍然[01:33.20]还在幻想[01:37.50]你的明天[01:43.10]她会好吗 还是更烂[01:49.88]对我而言是另一天[01:53.43]我曾经毁了我的一切[01:56.64]只想永远地离开[01:59.92]我曾经堕入无边黑暗[02:02.24]想挣扎无法自拔[02:04.89]我曾经象你象他象那野草野花[02:10.64]绝望着 渴望着[02:13.64]也哭也笑平凡着[03:03.48]向前走 就这么走[03:06.33]就算你被给过什么[03:09.18]向前走 就这么走[03:11.93]就算你被夺走什么[03:14.88]向前走 就这么走[03:17.68]就算你会错过什么[03:20.43]向前走 就这么走[03:23.23]就算你会[03:25.88]我曾经跨过山和大海[03:28.24]也穿过人山人海[03:30.54]我曾经拥有着一切[03:33.79]转眼都飘散如烟[03:36.34]我曾经失落失望失掉所有方向[03:42.14]直到看见平凡才是唯一的答案[03:47.79]我曾经毁了我的一切[03:50.94]只想永远地离开[03:53.49]我曾经堕入无边黑暗[03:56.39]想挣扎无法自拔[03:59.14]我曾经象你象他象那野草野花[04:04.89]绝望着 渴望着 也哭也笑平凡着[04:10.74]我曾经跨过山和大海[04:13.64]也穿过人山人海[04:16.24]我曾经问遍整个世界[04:19.59]从来没得到答案[04:22.98]我不过象你象他象那野草野花[04:27.74]冥冥中这是我 唯一要走的路啊[04:34.75]时间无言[04:36.25]如此这般[04:40.40]明天已在眼前[04:46.55]风吹过的 路依然远[04:51.65]你的故事讲到了哪"
		}
		/* ,
				{
					"name": "燕归巢",
					"singer": "张靓颖、张杰",
					"time": "03:31",
					"src": "http://www.ytmp3.cn/down/33884.mp3",
					"lrc": "[by:刘小清1703][ti:燕归巢][ar:艾森eysen][al:][by:九九Lrc歌词网～www.99Lrc.net][00:00.00] 作曲 : 无[00:00.00] 作词 : 无[00:00.00]作词：许嵩[00:08.34]作曲：许嵩[00:14.69]雨后江岸天破晓[00:17.94]老舟新客知多少[00:21.34]远山见竹林芳草[00:24.53]晨风抚绿了芭蕉[00:28.33]寒梅落尽把冬了[00:32.04]衔春的燕想归巢[00:35.63]沿途的景 牵挂的人[00:38.93]两情迢迢[00:42.93]柳叶桨溅桃花浪[00:44.94]汀州里鹤眺远方[00:49.39]饮一盏岁月留香[00:51.79]唱一曲往事飞扬[00:56.33]山水间歌声回荡[00:59.98]回荡思念的滚烫[01:03.59]去年的家书两行[01:06.69]读来又热了眼眶[01:10.41]云水边静沐暖阳[01:13.81]烟波里久违的故乡[01:17.62]别来无恙[01:19.77]你在心上[01:38.21]柳叶桨溅桃花浪[01:41.68]汀州里鹤眺远方[01:45.92]饮一盏岁月留香[01:48.43]唱一曲往事飞扬[01:53.00]山水间歌声回荡[01:56.61]回荡思念的滚烫[02:00.14]去年的家书两行[02:03.30]读来又热了眼眶[02:06.99]云水边静沐暖阳[02:10.33]烟波里久违的故乡[02:14.19]别来无恙[02:16.49]你在心上[02:21.39]儿时的窗 苍老的墙[02:25.55]是否偷换了方向[02:28.98]堂前的你和我相逢时[02:31.83]会沉默还是会诉尽衷肠[02:39.10]山水间歌声回荡[02:42.14]回荡思念的滚烫[02:45.94]去年的家书两行[02:48.74]读来又热了眼眶[02:52.75]云水边静沐暖阳[02:56.10]烟波里久违的故乡[02:59.85]别来无恙[03:02.10]你在心上[03:06.96]别来无恙[03:09.21]你在心上"
				} */
	],
	[{
			"basic": true,
			"name": "最近想听",
			"singer": "",
			"img": "http://imgcache.qq.com/music/photo/album_500/97/500_albumpic_1492897_0.jpg"
		}
		/* ,
				{
					"name": "只要平凡",
					"singer": "张杰 / 张碧晨",
					"time": "04:06",
					"img": "http://imgcache.qq.com/music/photo/album_500/51/500_albumpic_1796451_0.jpg",
					"src": "http://www.ytmp3.cn/down/55423.mp3",
					"lrc": "[00:00.00] 作曲 : 黄超[00:01.00] 作词 : 格格[00:03.06][00:04.79]也许很远或是昨天[00:08.75]在这里或在对岸[00:12.91]长路辗转离合悲欢[00:16.96]人聚又人散[00:21.13]放过对错才知答案[00:25.30]活着的勇敢[00:29.45]没有神的光环[00:33.53]你我生而平凡[00:37.82]在心碎中认清遗憾[00:41.88]生命漫长也短暂[00:45.96]跳动心脏长出藤蔓[00:50.09]愿为险而战[00:54.26]跌入灰暗坠入深渊[00:58.39]沾满泥土的脸[01:02.41]没有神的光环[01:06.37]握紧手中的平凡[01:10.75]此心此生无憾[01:14.64]生命的火已点燃[01:21.52]有一天也许会走远[01:25.21]也许还能再相见[01:29.40]无论在人群在天边[01:33.47]让我再看清你的脸[01:37.67]任泪水铺满了双眼[01:41.67]虽无言泪满面[01:45.86]不要神的光环[01:49.72]只要你的平凡[01:53.01][01:54.28]音乐制作人：黄超[01:55.02]编曲：黄超[01:55.18]吉他：黄超[01:55.35]单簧管：刘峤[01:55.54]和音编写：黄超[01:56.64]和音演唱：张杰 张碧晨[01:56.97]人声录音师：汝文博/朱玉婷[01:57.40]录音工作室：BIG.J Studio/香蕉计划录音棚[01:57.90]混音师：周天澈[01:58.13]母带工程师：周天澈[01:58.43]母带工作室：TC Faders[01:58.88][02:39.85]在心碎中认清遗憾[02:43.95]生命漫长也短暂[02:48.06]跳动心脏长出藤蔓[02:52.09]愿为险而战[02:56.31]跌入灰暗坠入深渊[03:00.45]沾满泥土的脸[03:04.50]没有神的光环[03:08.38]握紧手中的平凡[03:12.82]有一天也许会走远[03:16.92]也许还能再相见[03:21.13]无论在人群在天边[03:25.00]让我再看清你的脸[03:29.38]任泪水铺满了双眼[03:33.31]虽无言泪满面[03:37.61]不要神的光环[03:41.42]只要你的平凡[03:45.96]此心此生无憾[03:49.74]生命的火已点燃"
				},
				{
					"name": "需要人陪",
					"singer": "王力宏",
					"time": "04:11",
					"img": "http://imgcache.qq.com/music/photo/album_500/51/500_albumpic_1796451_0.jpg",
					"src": "http://www.ytmp3.cn/down/54719.mp3",
					"lrc": "[00:00.00] 作曲 : 王力宏[00:01.00] 作词 : 王力宏[00:12.330]打开窗户让孤单透气[00:17.130]这一间屋子 如此密闭[00:23.970]欢呼声仍飘在空气里[00:28.950]像空无一人一样华丽[00:33.780][00:35.190]我 渐渐失去知觉[00:40.860]就当做是种自我逃避[00:47.170]你 飞到天的边缘[00:52.540]我也不猜落在何地[00:57.230][00:58.020]一个我 需要梦想 需要方向 需要眼泪[01:03.850]更需要 一个人来 点亮天的黑[01:09.830]我已经 无能为力 无法抗拒 无路可退[01:16.000]这无声的夜 现在的我 需要人陪[01:25.300][01:34.990]闭上眼睛 就看不清[01:39.909]这双人床 欠缺的 温馨[01:46.960]谁能 陪我 直到天明[01:52.080]穿透这片 迷蒙寂静[01:56.830][01:57.909]我 渐渐失去知觉[02:03.640]就当做是种自我逃避[02:09.909]你 飞到天的边缘[02:15.740]我已不猜落在何地[02:20.200][02:20.840]一个我 需要梦想 需要方向 需要眼泪[02:26.800]更需要 一个人来 点亮天的黑[02:32.600]我已经 无能为力 无法抗拒 无路可退[02:38.970]这无声的夜 现在的我 需要人陪[02:47.890][03:08.230]一个我 需要梦想 需要方向 需要眼泪[03:14.000]更需要 一个人来 点亮天的黑[03:20.010]我已经 无能为力 无法抗拒 无路可退[03:26.360]这无声的夜 现在的我 需要人陪[03:36.240]"
				} */
	]
];